app/controllers/characters_controller.rb

  def index
    @characters = Character.all
---
SELECT "characters".* FROM "characters"

  def create
    @character = Character.new(character_params)

    respond_to do |format|
      if @character.save
---
INSERT INTO "characters" ("name", "role", "race", "gender", "age", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "Zero"], ["role", "Blademaster"], ["race", "Wiggler"], ["gender", "Male"], ["age", 27], ["created_at", "2020-02-11 23:59:22.037954"], ["updated_at", "2020-02-11 23:59:22.037954"]]

  def update
    respond_to do |format|
      if @character.update(character_params)
---
UPDATE "characters" SET "role" = ?, "updated_at" = ? WHERE "characters"."id" = ?  [["role", "All-around"], ["updated_at", "2020-02-12 00:06:58.455016"], ["id", 1]]

    def set_character
      @character = Character.find(params[:id])
---
SELECT  "characters".* FROM "characters" WHERE "characters"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]